app/controllers/projects_controller.rb

  def index
    @projects = Project.all
    @projects.each do |project|
      worked_hours = 0
      @time_entries = TimeEntry.where(id: project.id)
      @time_entries.each do |entry|
        worked_hours += entry.number_of_hours
      end
      project.update_attribute(:worked_hours, worked_hours)
---
SELECT "projects".* FROM "projects"
SELECT "time_entries".* FROM "time_entries" WHERE "time_entries"."Project_id" = ?  [["Project_id", 1]]
UPDATE "projects" SET "worked_hours" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["worked_hours", 0], ["updated_at", "2017-07-21 20:26:41.627667"], ["id", 1]]

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "description", "total_hours_to_finish", "worked_hours", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_time_entries
      if @project
        @time_entries  = TimeEntry.where(Project_id: @project.id)
        hours_worked = 0
        @time_entries.each do |entry|
          hours_worked += entry.number_of_hours
      end
      @project.update_attribute(:worked_hours, hours_worked)
---
SELECT "time_entries".* FROM "time_entries" WHERE "time_entries"."Project_id" = ?  [["Project_id", 2]]
SELECT "time_entries".* FROM "time_entries" WHERE "time_entries"."id" = ?  [["id", 1]]
UPDATE "projects" SET "worked_hours" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["worked_hours", 0], ["updated_at", "2017-07-21 21:17:40.575609"], ["id", 2]]