app/controllers/time_entries_controller.rb

  def index
    @time_entries = TimeEntry.all
---
SELECT "time_entries".* FROM "time_entries"

  def create
    @time_entry = TimeEntry.new(time_entry_params)

    respond_to do |format|
      if @time_entry.save
---
INSERT INTO "time_entries" ("number_of_hours", "date", "description", "Project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["number_of_hours", 10], ["date", "2017-07-21"], ["description", "test"], ["Project_id", 1], ["created_at", "2017-07-21 20:43:19.098684"], ["updated_at", "2017-07-21 20:43:19.098684"]]

    def set_time_entry
      @time_entry = TimeEntry.find(params[:id])
---
SELECT  "time_entries".* FROM "time_entries" WHERE "time_entries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]